Revit 2026 API

# WorksharingDisplaySettingsUserHasGraphicOverrides Method

---

Checks whether there are graphic overrides that would apply to elements owned by the given user in the "Individual Owners" display mode.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool UserHasGraphicOverrides(
	string username
)
```
```vb
Public Function UserHasGraphicOverrides (
	username As String
) As Boolean
```
```cpp
public:
bool UserHasGraphicOverrides(
	String^ username
)
```
```fsharp
member UserHasGraphicOverrides :
        username : string -> bool
```

#### Parameters

username String
     The username to check

#### Return Value

Boolean True if there are graphic overrides assigned to the username, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

There will always be graphic overrides for all users included in the user table. In addition, there may be other users who have been explicitly assigned overrides.

#### Reference

WorksharingDisplaySettings Class

Autodesk.Revit.DB Namespace